// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");

//СЕМИНАР Задачи на уроке.
// Задача 24:Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.
// 7 -> 28
// 4 -> 10
// 8 -> 36












// Console.Write("Введите число: ");
// int num = Convert.ToInt32(Console.ReadLine());
// int i = 0;
// int result = 0;
// for (i = 0; i <= num; i++)
// {
//     result = result + i;
// }
// Console.WriteLine(result);






// Задача 26: Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
// 456 -> 3
// 78 -> 2
// 89126 -> 5


 Console.Write("Введите число: ");
 int num = Convert.ToInt32(Console.ReadLine());
int k = 0;
int i = 0;
if (i < num)
while (num != 0)
{
    k = num/10; 
    k = k /10;   
        Console.WriteLine(k);
    }     
    
   











// Задача 28: Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.
// 4 -> 24 
// 5 -> 120



//Задача 30: Напишите программу,которая вывщдит массив из 8 элементов, заполнненый нулями и единицами
// в случайном порядке
// [1,0,1,1,0,1,0,0]

