// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
// Console.Write("Введите число 1: ");
// double num1 = Convert.ToDouble(Console.ReadLine());
// Console.Write("Введите число 2: ");
// double num2 = Convert.ToDouble(Console.ReadLine());
// if (num1 == num2 * num2)
// {
//    Console.WriteLine("кратно");
// }
// else 
// {
//       Console.Write("не кратно, остаток ");
//     Console.Write(num1 / num2);
// }



// Console.Write("Введите число1: ");
// int x = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число2: ");
// int y = Convert.ToInt32(Console.ReadLine());
// if (x > 0 && y > 0)
// {
//   Console.WriteLine("1 четверть");
// }
// else if (x < 0 && y > 0)
// {
//   Console.WriteLine("2 четверть");
// }
// else if (x < 0 && y < 0)
// {
//   Console.WriteLine("3 четверть");
// }

// if (x > 0 && y < 0)
// {
//   Console.WriteLine("4 четверть");
// }



//int num = Convert.ToInt32(Console.ReadLine());
//int [] nums = new int [5];
//int num = nums[5];

//int i = Convert.ToInt32(Console.ReadLine());
// for (int i = 0; i < nums.Length; i++)
// {

//  Console.WriteLine(nums[i]);
  // Console.WriteLine("ДА");

   //else
//Console.WriteLine("НЕТ");





// Задача 21// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
// A (3,6,8); B (2,1,-7), -> 15.84
// A (7,-5, 0); B (1,-1,9) -> 11.5
// Console.Write("Введите число A: ");
// double A = Convert.ToDouble(Console.ReadLine());
// Console.Write("Введите число B: ");
// double B = Convert.ToDouble(Console.ReadLine());
// double A = (x1,y1,z1)
// double B = (x2,y2,z2)


//   Console.WriteLine





// Задача 23// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125



