// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");

//Задачи на семинаре (класнная работа)
// Задача 39: Напишите программу, которая перевернёт одномерный массив (последний элемент будет на первом месте, 
//а первый - на последнем и т.д.)
// [1 2 3 4 5] -> [5 4 3 2 1]
// [6 7 3 6] -> [6 3 7 6]

// int[] array = new int[5];
// int result = 0;
// for (int i = 0; i < 5; i++)
// {
//     array[i] = new Random().Next(-9, 10);
//     Console.Write($"{ array[i]}   ");
// }
// Console.WriteLine();


// for (int i = 0; i < 5; i++)
// {
//     if (i == 5)
//   result = i;   
//     System.Console.WriteLine(result);
    // array[i] = i -1;
    // Console.Write($"{ array[i]}   ");
}



// Задача 40: Напишите программу, которая принимает на вход три числа и проверяет, может ли существовать 
//треугольник с сторонами такой длины. Теорема о неравенстве треугольника: каждая сторона треугольника 
//меньше суммы двух других сторон. 


// Задача 42: Напишите программу, которая будет преобразовывать десятичное число в двоичное.
// 45 -> 101101
// 3 -> 11
// 2 -> 10

// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 3

// Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, заданных 
//уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.
// b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)